УТ_для_edt/src/Catalogs/демоОборудованиеДляДемонстрации/демоОборудованиеДляДемонстрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>демоОборудованиеДляДемонстрации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прошивка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Чипы</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СНПЧ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инсталлировал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромывкаИОстатки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГотовностьКДемонстрации</name>
    <type>
      <types>EnumRef.демоСтатусГотовностиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДемоЗал</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияЧернил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЧернил</name>
    <comment>#Б-2352 смарт: Лопато 17.02.2025 //Добавить в журнал &quot;Оборудование демозала&quot; колонку Чернила</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробегОборудования</name>
    <comment>#6152 смарт: Тимофеева 27.03.2026 / Справочник Оборудование демозала. Добавление новых реквизитов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиПоказания</name>
    <comment>#6152 смарт: Тимофеева 27.03.2026 / Справочник Оборудование демозала. Добавление новых реквизитов.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОборудования</name>
    <comment>//++ #Б-7258 смарт: Фролов 29.06.2026 //CRM. Конверсия демонстраций</comment>
    <type>
      <types>CatalogRef.смартМодельныеРядыНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>табЧипы</name>
    <attributes>
      <name>МодельЧипа</name>
      <type>
        <types>CatalogRef.демоМатериалыДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>тчЧернила</name>
    <attributes>
      <name>Чернила</name>
      <type>
        <types>CatalogRef.демоМатериалыДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>тчДополнительныеОпцииУстановленные</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/демоСтатусГотовностиОборудования/демоСтатусГотовностиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>демоСтатусГотовностиОборудования</name>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>НеГотов</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСтатусыЗаявокНаМаркетинговоеМероприятие/смартСтатусыЗаявокНаМаркетинговоеМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыЗаявокНаМаркетинговоеМероприятие</name>
  <comment>#Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.</comment>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ПринятаВРаботу</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/демоОборудованиеДляДемонстрации/Forms/ФормаЭлемента/Module.bsl
//Каратеев 

#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаЗапуска 				= ТекущаяДата();
		Объект.Пользователь 			= Пользователи.ТекущийПользователь();
		Объект.ГотовностьКДемонстрации 	= Перечисления.демоСтатусГотовностиОборудования.НеГотов;
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовНаСервере();
	
	//++ #Б-1990 смарт: Лопато 19.02.2025 //Заявка на маркетинговое мероприятие. Активные заявки. Этап 5.
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды		

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//-- #Б-1990 смарт: Лопато 19.02.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОбновитьНаименование();
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();

	//++ #Б-1990 смарт: Лопато 19.02.2025 //Заявка на маркетинговое мероприятие. Активные заявки. Этап 5.
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//-- #Б-1990 смарт: Лопато 19.02.2025
	
КонецПроцедуры

//++ #Б-1986 смарт: Лопато 18.02.2025 //Заявка на маркетинговое мероприятие. Оборудование демозала. Этап 3.  
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//++ #Б-1986 смарт: Лопато 18.02.2025 //Заявка на маркетинговое мероприятие. Оборудование демозала. Этап 3.  
	Если НЕ ТекущийОбъект.Ссылка.Пустая()
		 И ТекущийОбъект.ГотовностьКДемонстрации <> ТекущийОбъект.Ссылка.ГотовностьКДемонстрации Тогда
		
		ПроверитьЕстьАктивныеЗаявки(ТекущийОбъект.Ссылка, ТекущаяДатаСеанса(), Отказ);
		
	КонецЕсли;	
	//-- #Б-1986 смарт: Лопато 18.02.2025
	
КонецПроцедуры

#КонецОбласти

//******************************************************************************
#Область ЭлементыФормы
	
&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовностьКДемонстрацииПриИзменении(Элемент)
	
	ОбновитьНаименование();
	УстановитьДоступностьЭлементовНаСервере();	
		
КонецПроцедуры

&НаКлиенте
Процедура СерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерий(Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ДемоЗалПриИзменении(Элемент)
	
	ОбновитьНаименование();
	УстановитьДоступностьЭлементов();
	ОчиститьПоляПриИзменении();
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура табЧипыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекСтрока = Объект.табЧипы;
	
КонецПроцедуры

&НаКлиенте
//++ #Б-1650 смарт: Фролов 18.12.2024 //Доработка функционала Маркетингового мероприятия. Доработки.
Процедура смартРезервОборудования(Команда)
	
	//++ #Б-1990 смарт: Лопато 19.02.2025 //Заявка на маркетинговое мероприятие. Активные заявки. Этап 5.
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала нужно записать элемент справочника!");
		Возврат;
	КонецЕсли;	
	//-- #Б-1990 смарт: Лопато 19.02.2025
	
	ТабДокумент = Новый ТабличныйДокумент;
	смартЗаполнитьРезервОборудованияДляПечати(ТабДокумент, Объект.Ссылка);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("смартРезервОборудования");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "смартРезервОборудования");
	ПечатнаяФорма.СинонимМакета = "смартРезервОборудования";
	ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
	
	ОбластиОбъектов = Новый СписокЗначений;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры //-- #Б-1650 смарт: Фролов 18.12.2024

&НаСервере
//++ #Б-1650 смарт: Фролов 18.12.2024 //Доработка функционала Маркетингового мероприятия. Доработки.
Процедура смартЗаполнитьРезервОборудованияДляПечати(ТабличныйДокумент, ОбъектСсылка)
	
	Справочники.демоОборудованиеДляДемонстрации.смартПечатьРезервОборудования(ТабличныйДокумент, ОбъектСсылка);
	
КонецПроцедуры //-- #Б-1650 смарт: Фролов 18.12.2024

//++ #Б-1990 смарт: Лопато 19.02.2025 //Заявка на маркетинговое мероприятие. Активные заявки. Этап 5.
&НаКлиенте
Процедура АктивныеМероприятия(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала нужно записать элемент справочника!");
		Возврат;
	КонецЕсли;	
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПечатьАктивныеМероприятияНаСервере(ТабДок, Объект.Ссылка);
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("АктивныеМероприятия");
	
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "АктивныеМероприятия");
	ПечатнаяФорма.СинонимМакета = "АктивныеМероприятия";
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
	
	ОбластиОбъектов = Новый СписокЗначений;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры //-- #Б-1990 смарт: Лопато 19.02.2025

//++ #Б-1990 смарт: Лопато 19.02.2025 //Заявка на маркетинговое мероприятие. Активные заявки. Этап 5.
&НаСервере
Процедура ПечатьАктивныеМероприятияНаСервере(ТабличныйДокумент, ОбъектСсылка)
	
	Справочники.демоОборудованиеДляДемонстрации.ПечатьАктивныеМероприятия(ТабличныйДокумент, ОбъектСсылка);
	
КонецПроцедуры //-- #Б-1990 смарт: Лопато 19.02.2025

#КонецОбласти

//******************************************************************************
#Область Общие

&НаСервере
Процедура ОбновитьНаименование()
	
	Оборудование 			= Строка(Объект.Номенклатура);
	ГотовностьКДемострации 	= ?(Объект.ГотовностьКДемонстрации.Пустая(), Строка(""), Строка(" / "+Объект.ГотовностьКДемонстрации));
	ДемоЗал					= ?(Объект.ДемоЗал.Пустая(), Строка(""), Строка(" ("+Объект.ДемоЗал+")"));
	
	Объект.Наименование = ?(Объект.Номенклатура.Пустая(), Строка(""), Оборудование+ДемоЗал+ГотовностьКДемострации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
	//Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные)Тогда
	//	Если ТекущиеДанные = Неопределено Тогда
	//		ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	//	Иначе
	//		ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	//	КонецЕсли;

	//	ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
	//	
	//	ЗначениеВозврата = Неопределено;

	//	
	//	ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,ПараметрыФормыУказанияСерий,ЭтаФорма,,,, Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение", ЭтотОбъект, Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодбор(Команда)
	
	Отказ = Ложь;
	//Если (ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Объект.Соглашение))
	//	ИЛИ Не ЗначениеЗаполнено(Объект.Валюта) Тогда
	//	ОчиститьСообщения();
	//	СообщитьОбОшибкахОткрытияПодбора(Отказ);
	//КонецЕсли;
	Если Элементы.ДемоЗал = Неопределено Тогда
		Сообщить("Перед началом подбора необходимо выбрать Склад", СтатусСообщения.Внимание);
		Отказ = Истина		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров'"); //НСтр("ru = 'Подбор товаров в %Документ%'");
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	//Иначе
	//	ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'реализацию товаров и услуг'"));
	//КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УникальныйИдентификатор",УникальныйИдентификатор); 
	//ПараметрыФормы.Вставить("Соглашение", Объект.Соглашение);
	//ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("Склад", Объект.ДемоЗал);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	//ПараметрыФормы.Вставить("Валюта", Объект.Валюта);
	ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
	ПараметрыФормы.Вставить("Дата", Объект.ДатаЗапуска);
	ПараметрыФормы.Вставить("ДатаНачалаДействия", Объект.ДатаЗапуска);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("НачальнаяСтраница", "СтраницаПодборТоваров");
	ПараметрыФормы.Вставить("ФормироватьДеревоПриОткрытии", Истина);
	//ПараметрыФормы.Вставить("РежимПодбораИсключитьГруппыДоступныеВЗаказах", Истина);
	//Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
	//	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре()));
	//	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",Истина);
	//КонецЕсли;
	//ПараметрыФормы.Вставить("СкрыватьПодакцизныеТовары", Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД"));
	//ПараметрыФормы.Вставить("ОтображатьФлагСкрыватьПодакцизныеТовары", Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД"));
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
		
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);  
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьДоступностьСтрокТЧ()
//	
//	Если Элементы.тчЧернилаЗаменены = Истина Тогда
//		Элементы.тчЧернилаДатаУстановки.Доступность = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Если Объект.ДемоЗал.Пустая() Тогда
		Элементы.Оборудование.Доступность = Ложь;
	Иначе
		Элементы.Оборудование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовНаСервере()

	Если Объект.ГотовностьКДемонстрации = Перечисления.демоСтатусГотовностиОборудования.Списано Тогда
		Элементы.ДатаСписания.Доступность = Истина;                                                  
	Иначе
		Элементы.ДатаСписания.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьПоляПриИзменении()
	
	Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Объект.СерийныйНомер = "не заполнено";
	
КонецПроцедуры

//++ #Б-1986 смарт: Лопато 18.02.2025 //Заявка на маркетинговое мероприятие. Оборудование демозала. Этап 3.  
Процедура ПроверитьЕстьАктивныеЗаявки(Оборудование, Дата, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации
	|ГДЕ
	|	Оборудование = &Оборудование
	|	И Ссылка.Проведен
	|	И (Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Новая)
	|	   ИЛИ Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.ПринятаВРаботу))	
	|	И (ВЫБОР
	|		   КОГДА НЕ Ссылка.смартДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|		   		ТОГДА Ссылка.смартДатаНачала
	|	   	   КОГДА НЕ Ссылка.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	|		   		ТОГДА Ссылка.ДатаНачалаПлан
	|	   	   ИНАЧЕ Ссылка.ЖелаемаяДатаИзготовления
	|	   КОНЕЦ >= &ДатаНачала
	|    ИЛИ
	|	   (ВЫБОР
	|		   КОГДА НЕ Ссылка.смартДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|		   		ТОГДА Ссылка.смартДатаНачала
	|	   	   КОГДА НЕ Ссылка.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	|		   		ТОГДА Ссылка.ДатаНачалаПлан
	|	   	   ИНАЧЕ Ссылка.ЖелаемаяДатаИзготовления
	|	    КОНЕЦ < &ДатаНачала
	|      И
	|	    ВЫБОР
	|		   КОГДА НЕ Ссылка.смартДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Ссылка.смартДатаОкончания
	|		   КОГДА НЕ Ссылка.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА КОНЕЦПЕРИОДА(Ссылка.ДатаНачалаПлан, ДЕНЬ)
	|		   ИНАЧЕ КОНЕЦПЕРИОДА(Ссылка.ЖелаемаяДатаИзготовления, ДЕНЬ)
	|	    КОНЕЦ > &ДатаНачала))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ДатаНачала",   НачалоДня(Дата));
	
	МассивАктивныхЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если МассивАктивныхЗаявок.Количество() > 0 Тогда

		СтрокаСообщенияЗаявки = "Необходимо закрыть следующие документы:" + Символы.ПС;
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщенияЗаявки, , , , Отказ);
		
		Для Каждого СтрЗаявка Из МассивАктивныхЗаявок Цикл
			ОбщегоНазначения.СообщитьПользователю(СокрЛП(СтрЗаявка.Ссылка), СтрЗаявка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры //-- #Б-1986 смарт: Лопато 18.02.2025

#КонецОбласти

//++ #Б-1990 смарт: Лопато 19.02.2025 //Заявка на маркетинговое мероприятие. Активные заявки. Этап 5.

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПробегОборудованияПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ДатаУстановкиПоказания)
		И ЗначениеЗаполнено(Объект.ПробегОборудования) Тогда
		Объект.ДатаУстановкиПоказания = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//-- #Б-1990 смарт: Лопато 19.02.2025
